app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE (show) LIMIT 1
---
  def show
    @artist = Artist.find_by(params[:id])

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Lucy"], ["created_at", "2018-06-19 17:04:00.439213"], ["updated_at", "2018-06-19 17:04:00.439213"]]
---
  def create
    @artist = Artist.new(artist_params)

    if @artist.save